app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages`  WHERE `pages`.`slug` = 'home'  ORDER BY `pages`.`id` ASC LIMIT 1
SELECT `team_members`.* FROM `team_members`  WHERE `team_members`.`active` = 1  ORDER BY `team_members`.`position` ASC
---
  def show
    if params[:id].present?
      @page = Page.where(slug: params[:id]).first
    else
      @page = Page.where(slug: 'home').first
    end

    if @page.slug == 'contact'
      @registrant = Registrant.new
    elsif @page.slug == 'team'
      @team_members = TeamMember.active.positioned
    elsif @page.slug == 'availability'
      @units = Unit.active.includes(:unit_line).order('unit_lines.number_of_bedrooms, units.price, units.floor, units.letter')